w6d5/cats_project/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
    def index
        @cats = Cat.all

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @cat = Cat.find(params[:id])

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["birth_date", "2020-10-21"], ["color", "orange"], ["name", "Luce"], ["sex", "F"], ["created_at", "2020-10-30 23:24:59.688222"], ["updated_at", "2020-10-30 23:24:59.688222"]]
---
    def create
        @cat = Cat.new(cat_params)
        if @cat.save