w8d1/redditclone/app/controllers/subs_controller.rb

    def update
        @sub = Sub.find_by(id: params[:id])
        if @sub.update(sub_params) && current_user.id == @sub.moderator_id
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "ALL DOGS"], ["updated_at", "2020-11-09 22:38:08.708569"], ["id", 1]]