w8d1/redditclone/app/views/posts/new.html.erb

        <input type="checkbox" name="post[sub_ids][]" value="<%= sub.id %>"
        <%= "checked" if @post.sub_ids.include?(sub.id) %>>
---
SELECT  1 AS one FROM "post_subs" WHERE "post_subs"."post_id" IS NULL AND "post_subs"."sub_id" = $1 LIMIT $2  [["sub_id", 5], ["LIMIT", 1]]