w8d1/W8D1 copy/redditclone/app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.author_id = current_user.id
        if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "sub_id", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "hi"], ["url", ""], ["content", ""], ["sub_id", 2], ["created_at", "2020-11-09 22:51:23.678863"], ["updated_at", "2020-11-09 22:51:23.678863"], ["author_id", 9]]

    def update
        @post = Post.find_by(id: params[:id])
        if @post.update(post_params) && current_user.id == @post.author_id
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "his hair sucks"], ["content", "just look at it, it sucks"], ["updated_at", "2020-11-09 22:54:28.219730"], ["id", 1]]