w8d1/W8D1 copy/redditclone/app/controllers/sessions_controller.rb

def create
    @goal = Goal.new(goal_params) #space
    @goal.user_id = params[:user_id]
    if !@goal.save
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"