w8d1/W8D1 copy/redditclone/app/controllers/users_controller.rb

    def update
        @user = User.find_by(id: params[:id])
        if @user.update(user_params) && current_user == @user
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$12$qmG6v4xLxhUywce/bQWe..2lwQusEb0bRpkDrISLCYDrbu7XXKtby"], ["updated_at", "2020-11-09 18:48:34.870861"], ["id", 2]]

    def destroy
        @user = User.find_by(id: params[:id])
        @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]