w6d4/Art_Share/app/controllers/users_controller.rb

    def create
        user = User.new(params.require(:user).permit(:name, :email))
        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Stephen Curry"], ["email", "stephen@curry.com"], ["created_at", "2020-10-28 23:32:04.958833"], ["updated_at", "2020-10-28 23:32:04.958833"]]